COLOR_MAP = {

    # 東亞
    "中國大陸": "#91ec18a7",
    "香港": "#ff9896",
    "日本": "#bcbd22",
    "南韓": "#17becf",

    # 東南亞
    "泰國": "#7c6d8d",
    "馬來西亞": "#2ca02c",
    "印尼": "#9467bd",
    "菲律賓": "#8c564b",
    "新加坡": "#e377c2",
    "越南": "#7f7f7f",
    "汶萊": "#aec7e8",
    "緬甸": "#98df8a",
    "柬埔寨": "#c5b0d5",
    "寮國": "#c49c94",

    # 南亞
    "南亞": "#ffbb78",
    "印度": "#ff7f0e",
    "巴基斯坦": "#fdae6b",
    "孟加拉": "#fdd0a2",
    "斯里蘭卡": "#f16913",
    "尼泊爾": "#fdae6b",
    "不丹": "#fee6ce",

    # 中亞
    "哈薩克": "#9edae5",

    # 中東
    "中東": "#c7c7c7",
    "伊朗": "#8c6d31",
    "伊拉克": "#bd9e39",
    "以色列": "#637939",
    "科威特": "#b5cf6b",
    "阿曼": "#cedb9c",
    "卡達": "#e7ba52",
    "沙烏地阿拉伯": "#ad494a",
    "土耳其": "#a55194",
    "阿拉伯聯合大公國": "#d6616b",

    # 北美
    "美國": "#d32c16",
    "加拿大": "#aec7e8",
    "墨西哥": "#ff7f0e",

    # 南美
    "南美洲": "#2ca02c",
    "巴西": "#98df8a",
    "智利": "#31a354",
    "秘魯": "#74c476",

    # 歐洲
    "德國": "#393b79",
    "法國": "#5254a3",
    "荷蘭": "#6b6ecf",
    "英國": "#9c9ede",
    "俄羅斯": "#637939",
    "奧地利": "#8ca252",
    "比利時": "#b5cf6b",
    "匈牙利": "#cedb9c",
    "義大利": "#8c6d31",
    "波蘭": "#bd9e39",
    "西班牙": "#e7ba52",
    "瑞典": "#843c39",
    "瑞士": "#ad494a",
    "烏克蘭": "#d6616b",
    "歐盟(註2)": "#969696",
    "東歐": "#bdbdbd",
    "歐洲": "#6954c9" ,

    # 非洲
    "非洲": "#7f7f7f",
    "阿爾及利亞": "#a1d99b",
    "安哥拉": "#74c476",
    "埃及": "#31a354",
    "南非": "#006d2c",
    "肯亞": "#9ecae1",
    "奈及利亞": "#3182bd",

    # 大洋洲
    "大洋洲": "#c6dbef",
    "澳大利亞": "#6baed6",
    "巴布亞紐幾內亞": "#9ecae1",
    "紐西蘭": "#3182bd",
}
